var brain = require("brain.js");
var fs = require("fs");

var net = new brain.NeuralNetwork({
    hiddenLayers: [5, 3],
    activation: 'sigmoid'
 });

function saveFile(){
    fs.writeFile("sleep.json", JSON.stringify(net.toJSON()), function(err) {
        if(err)
            return console.log(err);

        console.log("The file was saved");
    });
}

net.train(
[{input: {습도: 48, 소음: 35, 온도: 19, 밝기: 9}, output: {코골이: 1}},
    {input: {습도: 47, 소음: 32, 온도: 18, 밝기: 11}, output: {코골이: 1}},
    {input: {습도: 51, 소음: 35, 온도: 17, 밝기: 11}, output: {잘잠: 1}},
    {input: {습도: 50, 소음: 36, 온도: 18, 밝기: 11}, output: {코골이: 1}},
    {input: {습도: 49, 소음: 37, 온도: 16, 밝기: 9}, output: {코골이: 1}},
    {input: {습도: 50, 소음: 34, 온도: 15, 밝기: 10}, output: {코골이: 1}},
    {input: {습도: 53, 소음: 42, 온도: 15, 밝기: 9}, output: {잘잠: 1}},
    {input: {습도: 54, 소음: 45, 온도: 14, 밝기: 9}, output: {잘잠: 1}},
    {input: {습도: 56, 소음: 36, 온도: 14, 밝기: 6}, output: {잘잠: 1}},
    {input: {습도: 56, 소음: 37, 온도: 14, 밝기: 5}, output: {잘잠: 1}},
    {input: {습도: 57, 소음: 34, 온도: 13, 밝기: 5}, output: {잘잠: 1}},
    {input: {습도: 60, 소음: 42, 온도: 13, 밝기: 6}, output: {잘잠: 1}},
    {input: {습도: 62, 소음: 45, 온도: 14, 밝기: 4}, output: {잘잠: 1}},
    {input: {습도: 60, 소음: 42, 온도: 14, 밝기: 5}, output: {잘잠: 1}},
    {input: {습도: 63, 소음: 45, 온도: 13, 밝기: 6}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 62, 소음: 31, 온도: 13, 밝기: 4}, output: {잘잠: 1}},
    {input: {습도: 60, 소음: 45, 온도: 12, 밝기: 5}, output: {잘잠: 1}},
    {input: {습도: 61, 소음: 35, 온도: 14, 밝기: 2}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 60, 소음: 32, 온도: 13, 밝기: 1}, output: {잘잠: 1}},
    {input: {습도: 64, 소음: 35, 온도: 12, 밝기: 2}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 66, 소음: 36, 온도: 12, 밝기: 3}, output: {잘잠: 1}},
    {input: {습도: 67, 소음: 37, 온도: 12, 밝기: 2}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 69, 소음: 34, 온도: 12, 밝기: 3}, output: {코골이: 1}},
    {input: {습도: 70, 소음: 42, 온도: 14, 밝기: 3}, output: {코골이: 1}},
    {input: {습도: 74, 소음: 42, 온도: 13, 밝기: 3}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 78, 소음: 45, 온도: 12, 밝기: 2}, output: {잠에서깸: 1}},
    {input: {습도: 82, 소음: 36, 온도: 12, 밝기: 6}, output: {코골이: 1}},
    {input: {습도: 80, 소음: 37, 온도: 12, 밝기: 3}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 78, 소음: 34, 온도: 14, 밝기: 5}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 84, 소음: 42, 온도: 13, 밝기: 1}, output: {잠에서깸: 1}},
    {input: {습도: 76, 소음: 45, 온도: 12, 밝기: 2}, output: {잘잠: 1}},
    {input: {습도: 74, 소음: 42, 온도: 12, 밝기: 1}, output: {잘잠: 1}},
    {input: {습도: 74, 소음: 45, 온도: 12, 밝기: 3}, output: {코골이: 1}},
    {input: {습도: 75, 소음: 42, 온도: 12, 밝기: 6}, output: {코골이: 1}},
    {input: {습도: 72, 소음: 45, 온도: 14, 밝기: 2}, output: {코골이: 1}},
    {input: {습도: 68, 소음: 31, 온도: 13, 밝기: 3}, output: {코골이: 1}},
    {input: {습도: 66, 소음: 45, 온도: 12, 밝기: 1}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 66, 소음: 35, 온도: 12, 밝기: 2}, output: {코골이와_뒤척임: 1}},
    {input: {습도: 64, 소음: 32, 온도: 14, 밝기: 1}, output: {코골이: 1}},
    {input: {습도: 66, 소음: 35, 온도: 13, 밝기: 3}, output: {잘잠: 1}},
    {input: {습도: 62, 소음: 36, 온도: 12, 밝기: 4}, output: {잘잠: 1}},
    {input: {습도: 60, 소음: 37, 온도: 14, 밝기: 5}, output: {잘잠: 1}},
    {input: {습도: 58, 소음: 34, 온도: 14, 밝기: 6}, output: {잘잠: 1}},
    {input: {습도: 55, 소음: 42, 온도: 15, 밝기: 8}, output: {잘잠: 1}},
    {input: {습도: 53, 소음: 45, 온도: 16, 밝기: 10}, output: {잘잠: 1}},
    {input: {습도: 54, 소음: 42, 온도: 15, 밝기: 12}, output: {잘잠: 1}},
    {input: {습도: 52, 소음: 45, 온도: 18, 밝기: 10}, output: {잘잠: 1}},
    ]);
      
saveFile();
/*
var output = net.run({x축_가속도: -298, y축_가속도: 1290, z축_가속도: 176, 
    x축_자이로: -298, y축_자이로: 1290, z축_자이로: 199, 
    x축_지자기: -666, y축_지자기: 255, z축_지자기: 107});   // Standing Data
*/

